testAme/labs/lab7/initialConditions/system/functionObjects/integralValues
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

pInlet
{
	type		surfaceFieldValue;
	enabled		yes;
	log		true;
	writeFormat     binary;
	writeControl	runTime;
	writeInterval	0.01;
	regionType	patch;
	writeFields	no;
	name		inlet;
	operation	average;
	fields		(p);
	libs		("libfieldFunctionObjects.so");
}

pOutlet
{
	type		surfaceFieldValue;
	enabled		yes;
	log		true;
	writeFormat     binary;		
	writeControl	runTime;
	writeInterval	0.01;
	regionType	patch;
	writeFields	no;
	name		outlet;
	operation	average;
	fields		(p);
	libs		("libfieldFunctionObjects.so");
}




// ************************************************************************* //
